update graphs
